//*****************************************************************************
//
// モード遷移処理 [mode.cpp]
// Author : 小熊朗
//
//*****************************************************************************
#ifndef _MODE_H_
#define _MODE_H_

//*****************************************************************************
//インクルード
//*****************************************************************************
#include "manager.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CModeBase;
class CScene;
class CPlayer;

//*****************************************************************************
//クラス宣言
//*****************************************************************************
class CMode : public CManager
{
public:
	CMode();	//コンストラクタ
	~CMode();	//デストラクタ

	static CMode *Create();	//生成
	HRESULT Init(void);	//初期化
	void Update(void);	//更新
	void Uninit(void);	//終了

	void ChangeState(CModeBase *pModeBase);	//状態遷移
private:
	//メンバ変数
	//ポインタ
	CModeBase *m_pModeBase;	//モード基底
	CPlayer	*m_pPlayer;	//プレイヤー
};
#endif // !_MODE_H_
