//*****************************************************************************
//
// タイトル画面の処理 [title.h]
// Author : 小熊朗
//
//*****************************************************************************
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
//インクルード
//*****************************************************************************
#include "mode_base.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CBg;
class CFade;
class CSound;

//*****************************************************************************
//タイトル画面のクラス宣言
//*****************************************************************************
class CTitle :public CScene2D
{
public:
	CTitle();				//コンストラクタ
	~CTitle();								//デストラクタ

	//インスタンス生成
	CTitle *GetInstance();
	virtual void Init(CMode *pMode);							//初期化関数
	virtual void Update(CMode *pMode);						//更新関数
	virtual void Uninit(void);						//終了関数

private:
	//メンバ変数
	CSound					*m_pSound;		//サウンドのポインタ
};
#endif